# UnableGenerateTrussByFamilyAndOrientation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..UnableGenerateTrussByFamilyAndOrientation Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Revit is unable to generate a truss using the current Layout Family and Truss orientation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableGenerateTrussByFamilyAndOrientation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableGenerateTrussByFamilyAndOrientation As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableGenerateTrussByFamilyAndOrientation {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace